{
  "0.3.23": {
    "en": "Fix: EV charger no longer stays at 7A minimum when house base load alone exceeds the power limit. The phase-based control path now correctly pauses charging when household consumption (without the charger) exceeds the watt limit, matching the behavior of the wattage-based fallback path.",
    "no": "Fix: EV-lader holdes ikke lenger på 7A minimum når husforbruket alene overstiger effektgrensen. Den fasebaserte styringsveien pauser nå ladingen korrekt når husforbruket (uten laderen) overstiger watt-grensen, tilsvarende oppførselen i den wattagebaserte reserveveien."
  },
  "0.3.22": {
    "en": "Auto-detect electrical system phase count from HAN sensor: 'Auto-detect from HAN sensor' is now the default voltage system setting. The app reads live phase current data (L1/L2/L3) and meter capabilities to automatically determine whether the installation is single-phase (230V) or three-phase (400V). Manual override is still available. Settings page shows the detected system type in real time.",
    "no": "Auto-gjenkjenn fase-antall fra HAN-sensor: 'Auto-gjenkjenn fra HAN-sensor' er nå standard innstilling for spenningssystem. Appen leser sanntids fase-strøm (L1/L2/L3) og målerfunksjoner for å automatisk avgjøre om anlegget er enfase (230V) eller trefase (400V). Manuell overstyring er fortsatt mulig. Innstillingssiden viser oppdaget systemtype i sanntid."
  },
  "0.2.22": {
    "en": "New diagnostic Log tab for remote debugging: consolidated app log with category filters (HAN, Charger, Mitigation, Energy, Cache, System), color-coded badges, copy-to-clipboard (filtered or full JSON), auto-refresh, HAN meter summary, mitigation scan results, and system info. Makes it easy to share diagnostic data when reporting issues.",
    "no": "Ny diagnostikk-loggfane for feilsøking: samlet app-logg med kategorifiltre (HAN, Lader, Tiltak, Energi, Cache, System), fargekodede merkelapper, kopier til utklippstavle (filtrert eller full JSON), auto-oppdatering, HAN-måler-sammendrag, tiltak-skanneresultater og systeminfo. Gjør det enkelt å dele diagnostikkdata ved feilrapportering."
  },
  "0.2.21": {
    "en": "Høiax Connected 300/200 stepped power control: new 'Stepped power (Høiax)' action reduces water heater power one level per mitigation cycle (3000W → 1750W → 1250W → off). Supports both Høiax 300 and 200 models. Driver icons fixed. Thermostat mitigation now lowers by 3°C instead of setting to 5°C.",
    "no": "Høiax Connected 300/200 trinnvis effektstyring: ny 'Trinnvis effekt (Høiax)'-handling reduserer varmtvannsbereder ett nivå per tiltakssyklus (3000W → 1750W → 1250W → av). Støtter både Høiax 300 og 200 modeller. Driverikoner fikset. Termostat-tiltak senker nå med 3°C i stedet for å sette til 5°C."
  },
  "0.2.2": {
    "en": "Adax heater power estimation: detects when Adax reports constant rated wattage and estimates actual power from temperature state (room at target = 0W, room below target = rated wattage). Heater tab now correctly shows which Adax heaters are actively heating. Thermostat mitigation changed from setting to 5°C to lowering by 3°C from current target.",
    "no": "Adax-varmer effektestimering: oppdager når Adax rapporterer konstant nominell effekt og estimerer faktisk forbruk fra temperaturstatus (rom på mål = 0W, rom under mål = nominell effekt). Varmer-fanen viser nå korrekt hvilke Adax-varmere som aktivt varmer. Termostat-tiltak endret fra å sette til 5°C til å senke med 3°C fra nåværende mål."
  },
  "0.2.1": {
    "en": "Fixed Zaptec and Enua dynamic current control on Homey setups where getFlowCardActions() does not enumerate app flow cards. Now falls back to hardcoded known action IDs (installation_current_control / changeCurrentLimitAction) when discovery returns nothing, instead of silently skipping current adjustments.",
    "no": "Fikset Zaptec og Enua dynamisk strømstyring på Homey-oppsett hvor getFlowCardActions() ikke lister app-flythandlinger. Faller nå tilbake til kjente action-IDer (installation_current_control / changeCurrentLimitAction) når oppdagelse ikke finner noe, i stedet for å hoppe over strømjusteringer."
  },
  "0.2.0": {
    "en": "Dynamic flow action discovery: automatically finds the correct Flow action ID for Zaptec and Enua chargers at runtime. Improved test charger diagnostics with detailed Flow API reporting. No more hardcoded action IDs.",
    "no": "Dynamisk flow-action oppdagelse: finner automatisk riktig Flow action-ID for Zaptec og Enua ladere ved kjøring. Forbedret ladertest-diagnostikk med detaljert Flow API-rapportering. Ingen flere hardkodede action-IDer."
  },
  "0.1.9": {
    "en": "Added dynamic current control for Zaptec and Enua chargers via Homey Flow API. Zaptec uses installation_current_control (0-40A per phase), Enua uses changeCurrentLimitAction (6-32A). Auto-detects charger brand and routes to correct handler. Added Zaptec car-connected detection. Full Enua Charge E support with pause/resume and status monitoring.",
    "no": "Lagt til dynamisk strømstyring for Zaptec og Enua ladere via Homey Flow API. Zaptec bruker installation_current_control (0-40A per fase), Enua bruker changeCurrentLimitAction (6-32A). Auto-detekterer ladermerke og ruter til riktig handler. Lagt til Zaptec bil-tilkoblet deteksjon. Full Enua Charge E støtte med pause/gjenopptak og statusovervåking."
  },
  "0.1.8": {
    "en": "Fixed charger test diagnostic for Zaptec Go: now correctly detects charging_button capability and reports Zaptec charger status. Test no longer fails for non-Easee chargers.",
    "no": "Fikset ladertest-diagnostikk for Zaptec Go: oppdager nå charging_button-kapabilitet korrekt og rapporterer Zaptec-laderstatus. Testen feiler ikke lenger for ikke-Easee-ladere."
  },
  "0.1.7": {
    "en": "Fixed Easee Equalizer showing 0W: reads initial power value immediately on connect, faster first poll (2s), robust number handling for cloud-based meters.",
    "no": "Fikset Easee Equalizer som viste 0W: leser initial effektverdi umiddelbart ved tilkobling, raskere første poll (2s), robust tallhåndtering for skybaserte målere."
  },
  "0.1.6": {
    "en": "Added manual power meter selection on the System tab. Fixed auto-detect falsely matching devices like 'Hanna Thermostat'. Improved Futurehome HAN and Easee Equalizer support.",
    "no": "Lagt til manuelt valg av effektmåler på System-fanen. Fikset auto-deteksjon som feilaktig matchet enheter som 'Hanna Thermostat'. Forbedret støtte for Futurehome HAN og Easee Equalizer."
  },
  "0.1.5": {
    "en": "Added support for Easee Equalizer as HAN meter source and Zaptec charger detection. Expanded per-phase monitoring for Easee devices.",
    "no": "Lagt til støtte for Easee Equalizer som HAN-målerkilde og Zaptec-ladergjenkjenning. Utvidet faseovervåking for Easee-enheter."
  },
  "0.1.4": {
    "en": "Initial release. Real-time power monitoring with HAN meter, smart EV charger control with dynamic current adjustment, thermostat management, priority-based mitigation, and Norwegian capacity tariff tracking.",
    "no": "Første utgivelse. Sanntids effektovervåking med HAN-måler, smart elbilladerstyring med dynamisk strømjustering, termostatstyring, prioritetsbasert tiltak, og norsk effekttariff-sporing."
  },
  "0.3.0": {
    "en": "bugfix"
  },
  "0.3.2": {
    "en": "bugfix"
  },
  "0.3.21": {
    "en": "Per-phase current control for EV chargers: app now reads live per-phase amps (A/B/C) from the HAN sensor (Futurehome HAN and Easee Equalizer supported) and uses them directly to calculate available charger current. Fixes charger being throttled to minimum when voltageSystem was misconfigured. Falls back to wattage-based calculation when phase data is unavailable.",
    "no": "Fasebasert strømstyring for elbilladere: appen leser nå direktefase-ampere (A/B/C) fra HAN-sensoren (Futurehome HAN og Easee Equalizer støttes) og bruker disse til å beregne tilgjengelig ladestrøm. Fikser at laderen ble begrenset til minimum når voltageSystem var feilkonfigurert. Faller tilbake til watt-basert beregning når fasedata ikke er tilgjengelig."
  },
  "0.4.0": {
    "en": "bug fix"
  },
  "0.4.1": {
    "en": "flow card"
  },
  "0.6.0": {
    "en": "Multi-charger support: available headroom is now pooled and split evenly across all actively charging cars — a second connected-but-idle car no longer steals half the budget. EV charger phase count (1-phase / 3-phase) is now auto-detected from the live power/current ratio; no manual electrical config needed. Strict profile raised to 95% safety margin. Settings migration resets voltageSystem to auto on first start after update. Devices tab now always shows the EV charger as controlled by Power Guard while a car is connected and charging. Fixed a calculation bug that could cause charger current adjustments to be silently skipped.",
    "no": "Støtte for flere ladere: tilgjengelig effekt samles og fordeles likt mellom alle biler som faktisk lader — en tilkoblet-men-hvilende bil stjeler ikke lenger halve budsjettet. Fase-antall for EV-lader (enfase / trefase) detekteres nå automatisk fra live effekt/strøm-forholdet; ingen manuell konfigurasjon trengs. Streng profil hevet til 95% sikkerhetsmargin. Innstillingsmigrering nullstiller spenningssystem til auto ved første oppstart etter oppdatering. Enheter-fanen viser nå alltid EV-laderen som styrt av Power Guard mens en bil er tilkoblet og lader. Rettet en beregningsfeil som kunne føre til at strømjusteringer ble stille hoppet over."
  }
}
