{
  "0.2.2": {
    "en": "Adax heater power estimation: detects when Adax reports constant rated wattage and estimates actual power from temperature state (room at target = 0W, room below target = rated wattage). Heater tab now correctly shows which Adax heaters are actively heating. Thermostat mitigation changed from setting to 5°C to lowering by 3°C from current target.",
    "no": "Adax-varmer effektestimering: oppdager når Adax rapporterer konstant nominell effekt og estimerer faktisk forbruk fra temperaturstatus (rom på mål = 0W, rom under mål = nominell effekt). Varmer-fanen viser nå korrekt hvilke Adax-varmere som aktivt varmer. Termostat-tiltak endret fra å sette til 5°C til å senke med 3°C fra nåværende mål."
  },
  "0.2.1": {
    "en": "Fixed Zaptec and Enua dynamic current control on Homey setups where getFlowCardActions() does not enumerate app flow cards. Now falls back to hardcoded known action IDs (installation_current_control / changeCurrentLimitAction) when discovery returns nothing, instead of silently skipping current adjustments.",
    "no": "Fikset Zaptec og Enua dynamisk strømstyring på Homey-oppsett hvor getFlowCardActions() ikke lister app-flythandlinger. Faller nå tilbake til kjente action-IDer (installation_current_control / changeCurrentLimitAction) når oppdagelse ikke finner noe, i stedet for å hoppe over strømjusteringer."
  },
  "0.2.0": {
    "en": "Dynamic flow action discovery: automatically finds the correct Flow action ID for Zaptec and Enua chargers at runtime. Improved test charger diagnostics with detailed Flow API reporting. No more hardcoded action IDs.",
    "no": "Dynamisk flow-action oppdagelse: finner automatisk riktig Flow action-ID for Zaptec og Enua ladere ved kjøring. Forbedret ladertest-diagnostikk med detaljert Flow API-rapportering. Ingen flere hardkodede action-IDer."
  },
  "0.1.9": {
    "en": "Added dynamic current control for Zaptec and Enua chargers via Homey Flow API. Zaptec uses installation_current_control (0-40A per phase), Enua uses changeCurrentLimitAction (6-32A). Auto-detects charger brand and routes to correct handler. Added Zaptec car-connected detection. Full Enua Charge E support with pause/resume and status monitoring.",
    "no": "Lagt til dynamisk strømstyring for Zaptec og Enua ladere via Homey Flow API. Zaptec bruker installation_current_control (0-40A per fase), Enua bruker changeCurrentLimitAction (6-32A). Auto-detekterer ladermerke og ruter til riktig handler. Lagt til Zaptec bil-tilkoblet deteksjon. Full Enua Charge E støtte med pause/gjenopptak og statusovervåking."
  },
  "0.1.8": {
    "en": "Fixed charger test diagnostic for Zaptec Go: now correctly detects charging_button capability and reports Zaptec charger status. Test no longer fails for non-Easee chargers.",
    "no": "Fikset ladertest-diagnostikk for Zaptec Go: oppdager nå charging_button-kapabilitet korrekt og rapporterer Zaptec-laderstatus. Testen feiler ikke lenger for ikke-Easee-ladere."
  },
  "0.1.7": {
    "en": "Fixed Easee Equalizer showing 0W: reads initial power value immediately on connect, faster first poll (2s), robust number handling for cloud-based meters.",
    "no": "Fikset Easee Equalizer som viste 0W: leser initial effektverdi umiddelbart ved tilkobling, raskere første poll (2s), robust tallhåndtering for skybaserte målere."
  },
  "0.1.6": {
    "en": "Added manual power meter selection on the System tab. Fixed auto-detect falsely matching devices like 'Hanna Thermostat'. Improved Futurehome HAN and Easee Equalizer support.",
    "no": "Lagt til manuelt valg av effektmåler på System-fanen. Fikset auto-deteksjon som feilaktig matchet enheter som 'Hanna Thermostat'. Forbedret støtte for Futurehome HAN og Easee Equalizer."
  },
  "0.1.5": {
    "en": "Added support for Easee Equalizer as HAN meter source and Zaptec charger detection. Expanded per-phase monitoring for Easee devices.",
    "no": "Lagt til støtte for Easee Equalizer som HAN-målerkilde og Zaptec-ladergjenkjenning. Utvidet faseovervåking for Easee-enheter."
  },
  "0.1.4": {
    "en": "Initial release. Real-time power monitoring with HAN meter, smart EV charger control with dynamic current adjustment, thermostat management, priority-based mitigation, and Norwegian capacity tariff tracking.",
    "no": "Første utgivelse. Sanntids effektovervåking med HAN-måler, smart elbilladerstyring med dynamisk strømjustering, termostatstyring, prioritetsbasert tiltak, og norsk effekttariff-sporing."
  }
}